Revit 2024 API
DesignToFabricationConverter Constructor
 Creates a new instance of the DesignToFabricationConverter class.
Namespace: Autodesk.Revit.DB.Fabrication
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public DesignToFabricationConverter(
	Document document
)
Visual Basic
Public Sub New ( _
	document As Document _
)
Visual C++
public:
DesignToFabricationConverter(
	Document^ document
)
Parameters
document
Type: Autodesk.Revit.DB.Document
 A document in which to convert MEP design elements into fabrication parts.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
DesignToFabricationConverter Class
Autodesk.Revit.DB.Fabrication Namespace